
%******************************计算例1的距离矩阵*************************
x = [1, 2, 6, 8, 11]';    %例1中的观测数据
y = pdist(x)    %计算样品间欧氏距离
%-----------------------------------
%  pdist(X,metric)用来计算构成样品对的样品之间的距离
%  euelidean     欧氏距离，为默认情况
%  seuclidean    标准化欧氏距离
%  mahalanobis   马哈拉诺比斯距离
%  cityblock     绝对值距离
%  minkowski     闵可夫斯基距离
%  chebychev     切比雪夫距离
%-----------------------------------
D = squareform(y)    %将距离向量转为距离矩阵


%**************************根据原始数据创建系统聚类树************************
x = [1, 2, 6, 8, 11]';    % 例1中的观测数据
Z = linkage(x, 'single', 'cityblock')    %利用最短距离法创建系统聚类树
%  linkage:创建系统聚类树

%***************************分步聚类，绘制聚类树形图*************************
x = [1 2 6 8 11]';    % 例1中的观测数据
y = pdist(x,'cityblock');    % 计算样品间绝对值距离
z = linkage(y);    % 利用最短距离法创建系统聚类树
% 设定每个观测的标签
% 创建聚类树形图，方向为从右至左，叶节点标签在左边
obslabel = {'G1 = {1}';'G2 = {2}';'G3 = {6}';'G4 = {8}';'G5 = {11}'};
% 创建聚类树形图，方向为从右至左，叶节点标签在左边
[H,T] = dendrogram(z,'orientation','Right','labels',obslabel);
%dendrogram:做系统聚类树图形
set(H,'LineWidth',2,'Color','k')    % 设置线宽为2，颜色为黑色
xlabel('并类距离')      % 设定X轴标签
text(1.1,1.65,'G6')    % 在点(1.1,1.65)处放置字符串'G6'
text(2.1,3.65,'G7')    % 在点(2.1,3.65)处放置字符串'G7'
text(3.1,4.4,'G8')     % 在点(3.1,4.4)处放置字符串'G8'
text(4.1,3,'G9')       % 在点(4.1,3)处放置字符串'G9'



%*******************计算7种系统聚类法对应的Cophenetic相关系数****************
x = [1 2 6 8 11]';    % 例1中的观测数据
y = pdist(x,'cityblock');    % 计算样品间绝对值距离
% 定义元胞数组method，各元胞分别对应不同系统聚类法
method={'average','centroid','complete','median','single','ward','weighted'};
%类平均法，重心法，最长距离法，中间距离法
%最短距离法，离差平方合法，可变类平均法

% 通过循环计算7种系统聚类法对应的Cophenetic相关系数
for i = 1:7
    Z = linkage(y,method{i});    % 利用第i种系统聚类法创建聚类树
    c(i) = cophenet(Z,y);    % 计算第i种系统聚类法对应的Cophenetic相关系数
end
c    % 查看Cophenetic相关系数值
%Cophenetic相关系数反映了聚类效果的好坏，越是接近于1说明效果越好，
%可以通过Cophenetic相关系数对比各种不同的距离计算方法和不同的系统聚类方法的聚类效果